In [1]:
import pandas as pd

In [3]:
group_marks_data = pd.read_csv("group-marks.csv")
group_marks_data

,rollno,name,gender,group,session,age,scholarship,math,english,urdu
0,MS01,SAADIA,female,group B,MORNING,28,2562,No Idea,72.0,74
1,MS02,JUMAIMA,female,group C,AFTERNOON,33,2800,69,90.0,88
2,MS03,ARIFA,female,NaN,EVENING,34,3500,NaN,95.0,93
3,MS04,SAADIA,female,group A,MOR,44,2000,47,57.0,44
4,MS05,DANISH,male,group C,AFTERNOON,54,2100,76,78.0,55
5,MS06,SAFIA,female,group B,AFT,23,3800,NaN,83.0,78
6,MS07,SARA,female,group B,EVENING,47,3000,88,95.0,92
7,MS08,ABDULLAH,male,group B,EVE,33,2000,40,43.0,39
8,MS09,KHAN,male,group D,MORNING,27,2500,64,NaN,67
9,MS10,HASEENA,female,group B,AFT,33,2800,38,60.0,50
10,MS11,MUSTJAB,male,group C,MOR,46,3000,58,54.0,52
11,MS12,ABRAR,male,group D,MORNING,53,3312,40,52.0,43
12,MS13,MAHOOR,female,NaN,MOR,25,2345,65,81.0,73
13,MS14,USAMA,male,group A,AFTERNOON,26,2654,78,72.0,70
14,MS15,NAVAIRA,female,group A,AFT,25,2137,50,53.0,58
15,MS16,SAWAIRA,female,group C,EVENING,29,2567,69,75.0,78
16,MS17,NOFIL,male,group C,MOR,22,3500,88,89.0,86
17,MS18,SHUMAILA,female,group B,AFTERNOON,31,2500,18,NaN,28
18,MS19,ABUBAKAR,male,group C,AFT,33,3000,46,42.0,46
19,MS20,NADRA,female,group C,MORNING,36,2200,54,58.0,45
20,MS21,HASEEB,male,group D,AFTERNOON,34,3500,66,69.0,63
21,MS22,HOORIA,female,group B,EVENING,32,2000,65,75.0,70
22,MS23,RAUF,male,group D,MOR,31,2500,44,54.0,53
23,MS24,LAIBA,female,group C,AFTERNOON,37,3000,NaN,73.0,73
24,MS25,FATIMA,male,group D,AFT,33,2500,74,71.0,80
25,MS26,IBRAR,male,group A,EVENING,39,3500,73,74.0,72
26,MS27,USAMA,male,group B,EVE,32,2500,69,54.0,55
27,MS28,NOOR,female,group C,MORNING,47,3000,67,69.0,75
28,MS29,UMAR,male,group C,AFT,44,4000,70,70.0,65
29,MS30,ROSHAN,female,group D,MOR,42,3500,62,70.0,75
30,MS31,UNAIZA,female,group D,EVENING,41,2500,69,74.0,74
31,MS32,FATIMA,female,group B,EVE,19,3000,63,NaN,61
32,MS33,SHAISTA,female,NaN,MORNING,29,3500,56,72.0,65
33,MS34,ALI,male,group D,EVENING,34,3000,40,42.0,38
34,MS35,ABDULLAH,male,group E,MORNING,45,2500,97,87.0,82
35,MS36,OSAMA,male,group E,AFTERNOON,31,3500,81,81.0,79
36,MS37,AMBREEN,female,group D,EVENING,28,3000,74,81.0,62
37,MS38,NASEEM,female,group D,MOR,26,2500,50,64.0,59
38,MS39,SAFIA,female,group D,AFTERNOON,36,3500,75,90.0,88
39,MS40,NABEEL,male,group B,AFT,33,3000,57,56.0,57
40,MS41,SIKANDER,male,group C,EVENING,35,2500,55,61.0,54
41,MS42,ZAIN,female,group C,EVE,27,3500,58,73.0,68
42,MS43,AYESHA,female,group B,MORNING,38,3000,53,58.0,65
43,MS44,HASSAN,male,group B,AFT,31,2500,59,65.0,66
44,MS45,ZAINAB,female,group E,MOR,28,3500,NaN,56.0,54
45,MS46,TALHA,male,group B,EVENING,41,3000,65,54.0,57
46,MS47,SABA,female,group A,EVE,36,2500,55,65.0,62
47,MS48,RAFIA,female,group C,MORNING,30,3500,66,71.0,76
48,MS49,FATIMA,female,group D,MOR,40,2500,57,74.0,76
49,MS50,KAKAMANNA,male,group C,AFTERNOON,37,3000,66,78.0,81

In [7]:
group_marks_data.head()

,rollno,name,gender,group,session,age,scholarship,math,english,urdu
0,MS01,SAADIA,female,group B,MORNING,28,2562,No Idea,72.0,74
1,MS02,JUMAIMA,female,group C,AFTERNOON,33,2800,69,90.0,88
2,MS03,ARIFA,female,NaN,EVENING,34,3500,NaN,95.0,93
3,MS04,SAADIA,female,group A,MOR,44,2000,47,57.0,44
4,MS05,DANISH,male,group C,AFTERNOON,54,2100,76,78.0,55

In [9]:
group_marks_data.tail()

,rollno,name,gender,group,session,age,scholarship,math,english,urdu
45,MS46,TALHA,male,group B,EVENING,41,3000,65,54.0,57
46,MS47,SABA,female,group A,EVE,36,2500,55,65.0,62
47,MS48,RAFIA,female,group C,MORNING,30,3500,66,71.0,76
48,MS49,FATIMA,female,group D,MOR,40,2500,57,74.0,76
49,MS50,KAKAMANNA,male,group C,AFTERNOON,37,3000,66,78.0,81

In [11]:
group_marks_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   rollno       50 non-null     object
 1   name         50 non-null     object
 2   gender       50 non-null     object
 3   group        47 non-null     object
 4   session      50 non-null     object
 5   age          50 non-null     int64
 6   scholarship  50 non-null     int64
 7   math         46 non-null     object
 8   english      47 non-null     float64
 9   urdu         50 non-null     int64
dtypes: float64(1), int64(3), object(6)
memory usage: 4.0+ KB

In [13]:
group_marks_data.describe()

             age  scholarship    english      urdu
count  50.000000    50.000000  47.000000  50.00000
mean   34.360000  2875.540000  68.723404  65.28000
std     7.732149   513.405445  13.565785  14.87916
min    19.000000  2000.000000  42.000000  28.00000
25%    29.000000  2500.000000  57.500000  55.00000
50%    33.000000  3000.000000  71.000000  65.50000
75%    38.750000  3453.000000  76.500000  75.75000
max    54.000000  4000.000000  95.000000  93.00000

In [19]:
group_marks_data['math'] = pd.to_numeric(group_marks_data['math'], errors='coerce')
group_marks_data['group'] = group_marks_data['group'].fillna(group_marks_data['group'].mode()[0])
group_marks_data['math'] = group_marks_data['math'].fillna(group_marks_data['math'].mean())
group_marks_data['english'] = group_marks_data['english'].fillna(group_marks_data['english'].mean())

In [21]:
group_marks_data.drop_duplicates(inplace=True)

In [37]:
group_marks_data = pd.get_dummies(group_marks_data, columns=['gender'], drop_first=True)

KeyError: "None of [Index(['gender'], dtype='object')] are in the [columns]"

In [ ]:
from sklearn.preprocessing import MinMaxScaler
scaler = MinMaxScaler()
group_marks_data[['age', 'scholarship', 'math', 'english', 'urdu']] = scaler.fit_transform(
    group_marks_data[['age', 'scholarship', 'math', 'english', 'urdu']])

In [33]:
cleaned_file_path = 'group_marks_cleaned.csv'
group_marks_data.to_csv(cleaned_file_path, index=False)

In [31]:
group_marks_data.head()

,rollno,name,group,session,age,scholarship,math,english,urdu,gender_male
0,MS01,SAADIA,group B,MORNING,28,2562,61.644444,72.0,74,False
1,MS02,JUMAIMA,group C,AFTERNOON,33,2800,69.000000,90.0,88,False
2,MS03,ARIFA,group C,EVENING,34,3500,61.644444,95.0,93,False
3,MS04,SAADIA,group A,MOR,44,2000,47.000000,57.0,44,False
4,MS05,DANISH,group C,AFTERNOON,54,2100,76.000000,78.0,55,True